package pr2;

/* Вывести на экран первые 10 чисел гармонического ряда. */

public class z3 {
	public static void main(String[] args) {
        System.out.println("Первые 10 чисел гармонического ряда:");
        for (int i = 1; i <= 10; i++) {
        	System.out.println(1./i);
        }
    }
}
